---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeleteEditedElementError
source: html/ca085ac4-7444-0a56-70eb-ce14e830f271.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDeleteEditedElementError Property

Can't delete element that is being edited.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDeleteEditedElementError { get; }
```